name = str(input('Здравствуйте! Как Вас зовут? '))
print(f'Очень приятно {name}! Меня зовут Марк.')
age = int(input('Сколько Вам лет? '))
if age < 78:
    print(f'Да, {name}, я старше Вас на {78 - age} лет')
else:
    print(f'Да, {name}, Вы старше меня на {age - 78} лет')
yes_no = str(input('Вам нравится программировать? '))
if yes_no == 'да':
    print('Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.  ')
else:
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.')
